## Dependencies

In [2]:
import sqlite3
import pandas as pd

## Connecting to DB

In [3]:
conn = sqlite3.connect('Chinook_SQLite.sqlite')
cursor = conn.cursor()

## Exercises

In [4]:
def show_sql_query(command, nrows=10):
    cursor.execute(command)
    
    out = pd.read_sql_query(command, conn)
    display(out.head(nrows))
    print("Shape:", out.shape)

Using a subquery, find the names of all the tracks for the album "Californication".

In [5]:
command = """
SELECT Name
FROM Track
WHERE AlbumId IN (SELECT AlbumId
    FROM Album
    WHERE Title = "Californication");
"""

show_sql_query(command)

                Name
0   Around The World
1  Parallel Universe
2        Scar Tissue
3          Otherside
4         Get On Top
5    Californication
6             Easily
7          Porcelain
8        Emit Remmus
9        I Like Dirt

Shape: (15, 1)

2. Find the total number of invoices for each customer along with the customer's full name, city and email.

In [6]:
command = """
SELECT C.CustomerId, C.FirstName, C.Email, COUNT(I.InvoiceId) AS NumInvoices
FROM Customer AS C
LEFT JOIN Invoice AS I ON C.CustomerId = I.CustomerId
GROUP BY C.CustomerId
"""

show_sql_query(command)

   CustomerId  FirstName                     Email  NumInvoices
0           1       Luís      luisg@embraer.com.br            7
1           2     Leonie     leonekohler@surfeu.de            7
2           3   François       ftremblay@gmail.com            7
3           4      Bjørn     bjorn.hansen@yahoo.no            7
4           5  František  frantisekw@jetbrains.com            7
5           6     Helena           hholy@gmail.com            7
6           7     Astrid    astrid.gruber@apple.at            7
7           8       Daan     daan_peeters@apple.be            7
8           9       Kara     kara.nielsen@jubii.dk            7
9          10    Eduardo  eduardo@woodstock.com.br            7

Shape: (59, 4)

3. Retrieve the track name, album, artistID, and trackID for all the albums.

In [7]:
command = """
SELECT A.Title AS Album, T.TrackId, T.Name, R.Name AS Artist
FROM Album AS A
LEFT JOIN Track AS T ON A.AlbumId = T.AlbumId
LEFT JOIN Artist AS R ON A.ArtistId = R.ArtistId
"""

show_sql_query(command)

,Album,TrackId,Name,Artist
0,For Those About To Rock We Salute You,1,For Those About To Rock (We Salute You),AC/DC
1,For Those About To Rock We Salute You,6,Put The Finger On You,AC/DC
2,For Those About To Rock We Salute You,7,Let's Get It Up,AC/DC
3,For Those About To Rock We Salute You,8,Inject The Venom,AC/DC
4,For Those About To Rock We Salute You,9,Snowballed,AC/DC
5,For Those About To Rock We Salute You,10,Evil Walks,AC/DC
6,For Those About To Rock We Salute You,11,C.O.D.,AC/DC
7,For Those About To Rock We Salute You,12,Breaking The Rules,AC/DC
8,For Those About To Rock We Salute You,13,Night Of The Long Knives,AC/DC
9,For Those About To Rock We Salute You,14,Spellbound,AC/DC

Shape: (3503, 4)

4. Retrieve a list with the managers last name, and the last name of the employees who report to him or her.

In [8]:
command = """
SELECT M.LastName AS Employee, R.LastName AS ReportsToName
FROM Employee AS M
LEFT JOIN Employee AS R ON M.ReportsTo = R.EmployeeId
"""

show_sql_query(command)

   Employee ReportsToName
0     Adams          None
1   Edwards         Adams
2   Peacock       Edwards
3      Park       Edwards
4   Johnson       Edwards
5  Mitchell         Adams
6      King      Mitchell
7  Callahan      Mitchell

Shape: (8, 2)

5. Find the name and ID of the artists who do not have albums.

In [9]:
command = """
SELECT ART.Name AS Artist, ART.ArtistId, ALB.Title AS Album
FROM Artist AS ART
LEFT JOIN Album AS ALB ON ART.ArtistId = ALB.ArtistId
WHERE ALB.Title IS NULL
"""

show_sql_query(command)

                       Artist  ArtistId Album
0  Milton Nascimento & Bebeto        25  None
1                     Azymuth        26  None
2               João Gilberto        28  None
3              Bebel Gilberto        29  None
4               Jorge Vercilo        30  None
5               Baby Consuelo        31  None
6              Ney Matogrosso        32  None
7                Luiz Melodia        33  None
8                  Nando Reis        34  None
9       Pedro Luís & A Parede        35  None

Shape: (71, 3)

6. Use a UNION to create a list of all the employee's and customer's first names and last names ordered by the last name in descending order.

In [13]:
command = """
SELECT FirstName, LastName
FROM Customer
UNION
SELECT FirstName, LastName
FROM Employee
ORDER BY LastName DESC;
"""

show_sql_query(command)

   FirstName      LastName
0       Fynn    Zimmermann
1  Stanisław        Wójcik
2  František   Wichterlová
3   Johannes  Van der Berg
4   François      Tremblay
5       Mark        Taylor
6      Ellie      Sullivan
7     Victor       Stevens
8       Puja    Srivastava
9       Jack         Smith

Shape: (67, 2)

7. See if there are any customers who have a different city listed in their billing city versus their customer city.

In [16]:
command = """
SELECT C.FirstName, C.LastName, C.City, I.BillingCity
FROM Customer AS C
INNER JOIN invoice AS I ON C.CustomerId = I.CustomerId
WHERE C.City != I.BillingCity
"""

show_sql_query(command)

Empty DataFrame
Columns: [FirstName, LastName, City, BillingCity]
Index: []

Shape: (0, 4)